# Дан список чисел. Надо определить сколько встречается разных элементов

# data = [2, 8, 6, 2, 7, 2, 4, 4, 8, 8, 2]
# print(data)
# new_set = set(data) # Добавляем элементы в уникальное множество
# print(new_set)
# len_set = len(new_set)
# print(len_set)

# print(len(set(data)))  # Запись в одну строку

# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [3, 4, 5, 1, 2]

# data = [1, 2, 3, 4, 5]
# k = 3
# new_data = data[len(data)-k:] + data[:len(data)-k]
# print(new_data)

# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# data = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# s = set()
# for dic in data:
#    for val in dic.values():
#       s.add(val) # Убирает ключи
# print(s)

# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 
# (-1 < 5, 2 < 3)

# Первый вариант 
# data = [2, 5, 9, 12, 2, 6, 2, 0]
# count = 0
# for i in range(1, len(data)):
#     print(f"{i =}\t{data[i]= }")
#     if data[i - 1] < data[i]:
#         count += 1
# print(count)

# Второй вариант 

# data = [2, 5, 9, 12, 2, 6, 2, 0]
# # ответ 4
# count = 0
# for i in range(len(data) - 1):
#     print(f"{i = }\t{data[i] = }")
#     if data[i] < data[i + 1]:
#         count += 1
# print(count)